Catalogs/УсловияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>УсловияНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Позиция меню</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Миниатюра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иконка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НоменклатураМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураМеню</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АкцизныйНалог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>Базовая единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Безнадбавочный</Name>
					<Comment>На товар не распространяются ни какие надбавки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Безскидочный</Name>
					<Comment>На товар не распространяются ни какие скидки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Comment>Версия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Весовой</Name>
					<Comment>Весовой товар</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заменяемый</Name>
					<Comment>Товар заменяется в чеке</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЗаменяемостьНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модифицируемый</Name>
					<Comment>Блюдо имеет неотъемлемый модификатор</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Набор</Name>
					<Comment>Набор товаров и блюд</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Comment>Краткое наименование, для ККМ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПенсионныйФонд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Печатаемый</Name>
					<Comment>Печать товара в пречеке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Comment>Себестоимость</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Все виды услуг</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Розничная цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ценовой</Name>
					<Comment>Товар имеющий цену</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Штучный</Name>
					<Comment>Штучный товар</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСравнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/УсловияНоменклатуры/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьВидимость()
	
	// Командная панель.
	Элементы.ПодробныйРежим.Пометка = ПодробныйРежим;
	
	// Элементы.
	Элементы.Перенос.Видимость = Элементы.ПереносНоменклатуры.Пометка;
	
КонецПроцедуры // УстановитьВидимость()

&НаСервере
//Костенюк Александр-Старт 25.03.2014
Процедура УстановитьДоступностьНаСервере()
	
	//ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ПереносНоменклатуры.Доступность = (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Управляющий"));
	
КонецПроцедуры
//Костенюк Александр-Финиш 25.03.2014

&НаКлиенте
Процедура ПодробныйРежим(Команда)
	
	ПодробныйРежим = Не ПодробныйРежим;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПодробныйРежим()

&НаКлиенте
Процедура ПереносНоменклатуры(Команда)
	
	// Настройка формы.
	Элементы.ПереносНоменклатуры.Пометка = Не Элементы.ПереносНоменклатуры.Пометка;
	ПредотвратитьУстановкуАктуальности = Истина;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПереносНоменклатуры()


&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)

	//__ИнтерактивноеУправлениеДаннымиКлиент.АктуальностьСправочникаПриАктивизацииЯчейки(Элемент); //Костенюк Александр-Закомментировано 31.03.2014
	
КонецПроцедуры	// СписокПриАктивизацииЯчейки()

&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	__ИнтерактивноеУправлениеДаннымиКлиент.ПереносМенюПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле, "УсловияНоменклатуры");

КонецПроцедуры // СписокПроверкаПеретаскивания()

&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	__ИнтерактивноеУправлениеДаннымиКлиент.ПереносМенюПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле, "УсловияНоменклатуры");

КонецПроцедуры // СписокПеретаскивание()


&НаКлиенте
Процедура ПереносВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	__ИнтерактивноеУправлениеДаннымиКлиент.ПереносМенюВыборЗначения(Элементы.Список, Значение, СтандартнаяОбработка, "УсловияНоменклатуры");

КонецПроцедуры // ПереносВыборЗначения()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Параметры.
	Если Параметры.Свойство("ТекущаяСтрока") Тогда
		Параметры.ТекущаяСтрока = Справочники.УсловияНоменклатуры.НайтиПоНоменклатуре(Параметры.ТекущаяСтрока);
	КонецЕсли; 
	Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", ПолучитьСвойство(Параметры, "Номенклатура"));
	ОбработкаОповещенияСервер();
	
	// Режим выбора.
	__РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список, 
		"ПодробныйРежим, ПереносНоменклатуры, ИндексАктуальности,ПериодДействия,Комментарий");
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Настройка формы.
	УстановитьВидимость();
	УстановитьДоступностьНаСервере(); //Костенюк Александр 25.03.2014
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если __УправлениеДаннымиКлиентСервер.ОповещениеИзмененияАктуализацияМеню(ИмяСобытия) Тогда
		ОбработкаОповещенияСервер();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()

&НаСервере
Процедура ОбработкаОповещенияСервер()
	
	Список.Параметры.УстановитьЗначениеПараметра("НеактуализированныйСписок", РегистрыСведений.НоменклатураМеню.ПолучитьСписокНеактуализированнойНоменклатуры());
	
КонецПроцедуры // ОбработкаОповещенияСервер()
